{
  "content": "Andrew G. Stanton - Feb. 8, 2026\n\n---\n\nResurrection is not polite.\n\nOver time, it has been softened — wrapped in pastel language and seasonal metaphors. But at its core, resurrection is an act of resistance against the most entrenched assumption in human history: that death is final.\n\nNot only biological death, but the death of meaning. The death of accountability. The death of hope.\n\nEvery system built on inevitability quietly depends on this belief. Resurrection refuses it.\n\nThis is why resurrection has always unsettled empires.\n\nEmpires can tolerate moral teaching. They can absorb spirituality. They can even accommodate suffering, so long as suffering remains futile. What they cannot tolerate is the claim that their power is provisional.\n\nResurrection declares that force is not ultimate. That time does not belong exclusively to decay. That violence does not get the last word. That the world is not closed.\n\nThis is not political resistance. It is ontological resistance — a refusal to accept the structure of reality as defined by fear and power.\n\nSunday embodies this refusal not through spectacle, but through persistence.\n\nWeek after week, the Church gathers not to generate momentum, but to remember orientation. To realign with a truth that contradicts inevitability.\n\nThe risen Christ does not return with armies or retribution. He returns with wounds and peace. Authority without coercion.\n\nTo live as a resurrection people is to live misaligned with the incentives of the age.\n\nYou will look impractical.  \nYou will look slow.  \nYou will look naïve.\n\nYet over time, this misalignment reshapes the world more deeply than spectacle ever could.\n\nResurrection does not deny the darkness.  \nIt refuses to grant it finality.",
  "created_at": 1770582007,
  "id": "2bb3cd96b7a48bcd99e46fbc452bb75b032d35af206f85efd67d5f5fb8ffa9aa",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "389fcae7aaafd232f49cdab2b5b43f52b76f505340e896fe678757046c34447fb71e99d60a62116a4473e3f25576f8db4436f74b2cd0d24246c0d73be1f7881b",
  "tags": [
    [
      "d",
      "resurrection-refuses-finality"
    ],
    [
      "title",
      "Resurrection Refuses Finality"
    ],
    [
      "summary",
      "Resurrection is not sentimental comfort but a quiet refusal to accept despair as inevitable. This essay explores resurrection as ontological resistance — a challenge to systems built on finality, fear, and decay — and why Sunday remains a defiant reorientation of reality itself."
    ],
    [
      "published_at",
      "1770582007"
    ],
    [
      "client",
      "Continuum-Pro-localhost"
    ],
    [
      "t",
      "resurrection"
    ],
    [
      "t",
      "resistance"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "sovereignty"
    ],
    [
      "t",
      "faith"
    ],
    [
      "t",
      "sunday"
    ],
    [
      "display_date",
      "2026-02-08"
    ]
  ]
}