{
  "content": "Andrew G. Stanton - Jan. 17, 2026\n\nThere’s a quiet tension many creators live with but rarely talk about.\n\nWe use big platforms every day. We post there. We share there. Sometimes we even enjoy it there. And yet, somewhere in the background, there’s a low-grade discomfort — a sense that the things we’re making don’t quite belong to us in the way they should.\n\nThis often leads to an all-or-nothing framing:  \nEither you fully embrace the platform, or you burn the boats and leave.\n\nBut that framing isn’t very helpful. And for most people, it isn’t very realistic.\n\nThere’s a middle path that looks much less dramatic, but works surprisingly well over time.\n\nThink of YouTube cooking videos.\n\nA cooking channel might disappear tomorrow. Algorithms change. Accounts get flagged. Platforms rise and fall. But the recipes? Those don’t have to disappear with the channel.\n\nThe video is the performance.  \nThe recipe is the substance.\n\nGood cooks know this instinctively. They keep notebooks. They write things down. They test and refine outside the spotlight. The platform is where the dish is shown — not where the knowledge lives.\n\nBuilding this way doesn’t require quitting anything.\n\nIt just requires a small mental shift: separating *where something is shared* from *where it’s kept*.\n\nYou can publish essays on a large platform and still write them first in your own files. You can share photos widely while keeping originals organized locally. You can participate fully without letting participation be the only place your work exists.\n\nThis isn’t about purity. It’s about architecture.\n\nUsing a shared tool doesn’t mean you’ve surrendered ownership. It just means you’re being practical about distribution.\n\nNobody accuses a chef of selling out because they didn’t build their own stove.\n\nThe quiet work happens offstage.  \nThe platform is just where the lights are.\n\nAnd when you build this way, something subtle but important changes. You stop feeling anxious about every update or policy shift. You stop wondering whether your work will vanish one day. You know where it lives.\n\nYou don’t have to leave the city to stop building only for it.\n\nYou just have to keep your own copies.",
  "created_at": 1768678946,
  "id": "3108dc2df4118ad5c2473be443342aebd12eb78d24ebde87a23cf60fd0ccb303",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "599f02d534db7ffc3c8040af555333986b6b5c54a663061da577ccdcb66d6d9f5fc3bfaca7e5036d6e05bb1989e5fcda147d06e675a19e73163da6e7d6726dda",
  "tags": [
    [
      "d",
      "you-can-build-real-things-even-if-youre-still-using-big-platforms"
    ],
    [
      "title",
      "You Can Build Real Things Even If You’re Still Using Big Platforms"
    ],
    [
      "summary",
      "You don’t have to dramatically quit every major platform to build meaningful, durable work. It’s possible to use existing tools while quietly keeping what you create grounded, portable, and truly yours. This piece explores a gentler, more realistic path between total dependence and total exit."
    ],
    [
      "published_at",
      "1768678946"
    ],
    [
      "client",
      "Continuum-localhost"
    ],
    [
      "t",
      "creation"
    ],
    [
      "t",
      "writing"
    ],
    [
      "t",
      "digitalcraft"
    ],
    [
      "t",
      "independence"
    ],
    [
      "t",
      "weekendreading"
    ],
    [
      "t",
      "longtermthinking"
    ],
    [
      "display_date",
      "2026-01-17"
    ],
    [
      "image",
      "https://2026.mycontinuum.xyz/archive/pro/nostr/npub19wvckp8z58lxs4djuz43pwujka6tthaq77yjd3axttsgppnj0ersgdguvd/images/2026-01-17-generated-sabbath-set.png"
    ]
  ],
  "_source": [
    "wss://nostr.mom",
    "wss://relay.snort.social",
    "wss://relay.damus.io",
    "wss://nos.lol"
  ]
}