{
  "content": "Andrew G. Stanton - Feb. 8, 2026\n\n---\n\nThe first witnesses of the resurrection did not leave the tomb with answers.\n\nThey left with a disturbance.\n\nThey arrived expecting finality. What they encountered instead was absence — and a question.\n\n“Why do you seek the living among the dead?”\n\nResurrection does not hand the disciples a blueprint. It relocates uncertainty rather than removing it.\n\nWhat they carry out of the tomb is not certainty about the future, but confidence about its author.\n\nThe risen Christ does not say, “Understand this.”  \nHe says, “Follow Me.”\n\nResurrection does not simplify life.  \nIt anchors it.\n\nIt anchors work that feels futile.  \nIt anchors obedience that goes unseen.  \nIt anchors love that is not returned.\n\nThe disciples do not become heroes overnight. They doubt. They scatter. Resurrection entrusts them with witness anyway.\n\n“Go and tell.”\n\nNot because they understand fully, but because reality has shifted.\n\nSunday does not conclude the narrative.  \nIt initiates the long obedience of hope.\n\nHope here is not a feeling. It is a discipline — a refusal to concede the future to decay.\n\nWe leave the tomb carrying questions, wounds, and responsibility — and the knowledge that life has already broken through the worst the world can offer.\n\nThat knowledge does not make the road easy.\n\nIt makes it worth walking.",
  "created_at": 1770582171,
  "id": "7e74cde353cd8888f8c03517f586ce4d81ea92cc5202f4804f46a34be67bc73a",
  "kind": 30023,
  "pubkey": "2b998b04e2a1fe6855b2e0ab10bb92b774b5dfa0f78926c7a65ae08086727e47",
  "sig": "ffc8d15ced0b69d1085f416f8ec62e0a8dd1c21c1f32d3a804cd083b116f33acb29b2308429ebef8e564bf8604464a7b0795496484f7230dc8adb684135fd66c",
  "tags": [
    [
      "d",
      "after-sunday-what-resurrection-demands"
    ],
    [
      "title",
      "After Sunday: What Resurrection Demands"
    ],
    [
      "summary",
      "The resurrection does not give the disciples answers — it gives them a calling. This essay reflects on what it means to leave the tomb without certainty, carrying presence, responsibility, and hope into a world that has not yet been healed."
    ],
    [
      "published_at",
      "1770582171"
    ],
    [
      "client",
      "Continuum-Pro-localhost"
    ],
    [
      "t",
      "resurrection"
    ],
    [
      "t",
      "calling"
    ],
    [
      "t",
      "discipleship"
    ],
    [
      "t",
      "hope"
    ],
    [
      "t",
      "sunday"
    ],
    [
      "t",
      "faithfulness"
    ],
    [
      "display_date",
      "2026-02-8"
    ]
  ]
}